app/Controllers/AsistenciasController.php

SELECT *
FROM `asistencias`
WHERE `status` = 1
---
    public function getAll()
    {
        $asistencias = new AsistenciaModel();
        $arrData = $asistencias->where('status', 1)->findAll();

SELECT *
FROM `asistencias`
WHERE `asistencias`.`idAsistencia` = '4'
---
    public function getId($idAsistencia)
    {
        $asistencias = new AsistenciaModel();
        $arrData = $asistencias->find($idAsistencia);

UPDATE `asistencias` SET `status` = 0
WHERE `idAsistencia` = '4'
---
    public function completado()
    {
        $asistencias = new AsistenciaModel();
        $idAsistencia = $this->request->getPost("idAsistencia");
        $request = $asistencias->where('idAsistencia', $idAsistencia)->set(['status' => 0])->update();