app/Controllers/DashboardController.php

SELECT *
FROM `asistencias`
WHERE `status` = 1
---
    public function pendientes()
    {
        $asistencias = new AsistenciaModel();
        $cantidad = $asistencias->where('status', 1)->findAll();

SELECT *
FROM `asistencias`
WHERE `status` = 2
---
    public function dictamenRealizado()
    {
        $asistencias = new AsistenciaModel();
        $cantidad = $asistencias->where('status', 2)->findAll();

SELECT *
FROM `asistencias`
WHERE `status` = 0
---
    public function sinDictamen()
    {
        $asistencias = new AsistenciaModel();
        $cantidad = $asistencias->where('status', 0)->findAll();

SELECT *
FROM `usuarios`
---
    public function usuariosRegistrados()
    {
        $usuarios = new UsuariosModel();
        $cantidad = $usuarios->findAll();