app/Controllers/HistorialController.php

    public function getAll()
    {
        $asistencias = new AsistenciaModel();
        $arrData = $asistencias->where("status != 1")->findAll();
---
SELECT *
FROM `asistencias`
WHERE `status` != 1

    public function getCompletado($idAsistencia)
    {
        $asistencias = new AsistenciaModel();
        $arrData = $asistencias->find($idAsistencia);
---
SELECT *
FROM `asistencias`
WHERE `asistencias`.`idAsistencia` = '1'